Repository: knoticoo/kings
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: King's Choice Management
ru: Управление King's Choice

source: Dashboard
ru: Панель управления

source: Players
ru: Игроки

source: Alliances
ru: Альянсы

source: Events
ru: События

source: Control Panel
ru: Панель управления

source: Current MVP
ru: Текущий MVP

source: Current Winner
ru: Текущий победитель

source: Recent Events
ru: Последние события

source: Quick Actions
ru: Быстрые действия

source: Management Tools
ru: Инструменты управления

source: Add Player
ru: Добавить игрока

source: Add Alliance
ru: Добавить альянс

source: Add Event
ru: Добавить событие

source: Assign MVP
ru: Назначить MVP

source: Assign Winner
ru: Назначить победителя

source: MVP not assigned
ru: MVP не назначен

source: No player currently has MVP status.
ru: Ни один игрок в настоящее время не имеет звания MVP.

source: Winner not assigned
ru: Победитель не назначен

source: No alliance currently has winner status.
ru: Ни одному альянсу в настоящее время не присвоено звание победителя.

source: Completed
ru: Завершено

source: Partial
ru: Частично

source: Incomplete
ru: Незавершено

source: Waiting
ru: Ожидает

source: Assigned
ru: Назначен

source: Total Players
ru: Игроки

source: Total Alliances
ru: Альянсы

source: Total Events
ru: События

source: MVP Count
ru: Количество MVP

source: Win Count
ru: Количество побед

source: Last Update
ru: Последнее обновление

source: View all players
ru: Посмотреть всех игроков

source: View all alliances
ru: Посмотреть все альянсы

source: View all events
ru: Посмотреть все события

source: View blacklist
ru: Посмотреть черный список

source: View all guides
ru: Посмотреть все руководства

source: Create first event
ru: Создать первое событие

source: Actions
ru: Действия

source: Event
ru: Событие

source: Date
ru: Дата

source: Status
ru: Статус

source: Description
ru: Описание

source: Name
ru: Имя

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Save
ru: Сохранить

source: Cancel
ru: Отмена

source: Add
ru: Добавить

source: List
ru: Список

source: View
ru: Просмотр

source: King's Choice Management System
ru: Система управления King's Choice

source: Created with Flask & Bootstrap
ru: Создано с Flask & Bootstrap

source: Error loading dashboard data
ru: Ошибка загрузки данных панели управления

source: Failed to load dashboard data
ru: Не удалось загрузить данные панели управления

source: Current time
ru: Текущее время

source: Add and assign
ru: Добавить и назначить

source: No events yet
ru: Пока нет событий

source: Events have not been created yet.
ru: События еще не созданы.

source: Winner
ru: Победитель

source: Guides
ru: Руководства

source: Guide Categories
ru: Категории руководств

source: Featured Guides
ru: Рекомендуемые руководства

source: Recent Guides
ru: Недавние руководства

source: All Guides
ru: Все руководства

source: Search Guides
ru: Поиск руководств

source: No guides found
ru: Руководства не найдены

source: View Guide
ru: Просмотр руководства

source: Read More
ru: Читать далее

source: Related Guides
ru: Похожие руководства

source: Guide Management
ru: Управление руководствами

source: Add Guide
ru: Добавить руководство

source: Edit Guide
ru: Редактировать руководство

source: Delete Guide
ru: Удалить руководство

source: Category Management
ru: Управление категориями

source: Add Category
ru: Добавить категорию

source: Edit Category
ru: Редактировать категорию

source: Delete Category
ru: Удалить категорию

source: Title
ru: Заголовок

source: Content
ru: Содержание

source: Excerpt
ru: Краткое описание

source: Category
ru: Категория

source: Featured Image
ru: Главное изображение

source: Published
ru: Опубликовано

source: Featured
ru: Рекомендуемое

source: View Count
ru: Количество просмотров

source: Sort Order
ru: Порядок сортировки

source: Icon
ru: Иконка

source: Active
ru: Активно

source: Search
ru: Поиск

source: Search results for
ru: Результаты поиска для

source: Blacklist Management
ru: Управление черным списком

source: Blacklist
ru: Черный список

source: Add Entry
ru: Добавить запись

source: Total Entries
ru: Всего записей

source: Alliance Entries
ru: Записи альянсов

source: Player Entries
ru: Записи игроков

source: Blacklisted Alliances
ru: Альянсы в черном списке

source: Blacklisted Players
ru: Игроки в черном списке

source: Alliance Name
ru: Название альянса

source: Player Name
ru: Имя игрока

source: Enter alliance name (optional)
ru: Введите название альянса (необязательно)

source: Enter player name (optional)
ru: Введите имя игрока (необязательно)

source: Leave empty if adding only a player without alliance
ru: Оставьте пустым, если добавляете только игрока без альянса

source: Leave empty if adding only an alliance
ru: Оставьте пустым, если добавляете только альянс

source: Leave empty if editing only a player without alliance
ru: Оставьте пустым, если редактируете только игрока без альянса

source: Leave empty if editing only an alliance
ru: Оставьте пустым, если редактируете только альянс

source: Note:
ru: Примечание:

source: You must provide either an alliance name or a player name (or both).
ru: Необходимо указать либо название альянса, либо имя игрока (или и то, и другое).

source: Add Blacklist Entry
ru: Добавить запись в черный список

source: Edit Blacklist Entry
ru: Редактировать запись черного списка

source: Update Entry
ru: Обновить запись

source: Added
ru: Добавлено

source: Are you sure you want to delete this entry?
ru: Вы уверены, что хотите удалить эту запись?

source: No Blacklist Entries
ru: Нет записей в черном списке

source: The blacklist is currently empty. Add entries to start managing blacklisted alliances and players.
ru: Черный список в настоящее время пуст. Добавьте записи, чтобы начать управление заблокированными альянсами и игроками.

source: Add First Entry
ru: Добавить первую запись

source: How to Use
ru: Как использовать

source: Alliance Only
ru: Только альянс

source: Enter only the alliance name to blacklist an entire alliance.
ru: Введите только название альянса, чтобы заблокировать весь альянс.

source: Player Only
ru: Только игрок

source: Enter only the player name to blacklist a specific player.
ru: Введите только имя игрока, чтобы заблокировать конкретного игрока.

source: Player with Alliance
ru: Игрок с альянсом

source: Enter both alliance and player name to blacklist a specific player from a specific alliance.
ru: Введите название альянса и имя игрока, чтобы заблокировать конкретного игрока из определенного альянса.

source: Current Entry
ru: Текущая запись

source: Alliance:
ru: Альянс:

source: Player:
ru: Игрок:

source: Not specified
ru: Не указано

source: Created:
ru: Создано:

source: Last Updated:
ru: Последнее обновление:

source: Failed to load blacklist data
ru: Не удалось загрузить данные черного списка

source: Either alliance name or player name is required
ru: Необходимо указать либо название альянса, либо имя игрока

source: This entry already exists in the blacklist
ru: Эта запись уже существует в черном списке

source: Blacklist entry added successfully!
ru: Запись в черный список успешно добавлена!

source: Failed to add blacklist entry
ru: Не удалось добавить запись в черный список

source: Blacklist entry updated successfully!
ru: Запись в черном списке успешно обновлена!

source: Failed to update blacklist entry
ru: Не удалось обновить запись в черном списке

source: Blacklist entry deleted successfully!
ru: Запись в черном списке успешно удалена!

source: Failed to delete blacklist entry
ru: Не удалось удалить запись из черного списка

source: Export
ru: Экспорт

source: Export Blacklist
ru: Экспорт черного списка

source: Export MVP List
ru: Экспорт списка MVP

source: Export Format
ru: Формат экспорта

source: Formatted Text
ru: Форматированный текст

source: Simple List
ru: Простой список

source: Export Text
ru: Текст для экспорта

source: Copy to Clipboard
ru: Копировать в буфер обмена

source: Copied!
ru: Скопировано!

source: Close
ru: Закрыть

source: Blacklist [
ru: Черный список [

source: Alliances:
ru: Альянсы:

source: Players:
ru: Игроки:

source: Blacklist Export -
ru: Экспорт черного списка -

source: Settings
ru: Настройки

source: My Feedback
ru: Мой отзыв

source: Logout
ru: Выйти

source: Login
ru: Войти

source: Register
ru: Регистрация

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: Confirm Password
ru: Подтвердите пароль

source: Email
ru: Электронная почта

source: Remember Me
ru: Запомнить меня

source: Forgot Password?
ru: Забыли пароль?

source: Don't have an account?
ru: Нет аккаунта?

source: Already have an account?
ru: Уже есть аккаунт?

source: Sign Up
ru: Зарегистрироваться

source: Sign In
ru: Войти

source: Player Management
ru: Управление игроками

source: Edit Player
ru: Редактировать игрока

source: Alliance
ru: Альянс

source: Is Current MVP
ru: Текущий MVP

source: Is Blacklisted
ru: В черном списке

source: Created At
ru: Создано

source: Updated At
ru: Обновлено

source: Player Details
ru: Детали игрока

source: MVP History
ru: История MVP

source: Unassign MVP
ru: Снять MVP

source: Select Player
ru: Выберите игрока

source: Select Event
ru: Выберите событие

source: Assign
ru: Назначить

source: Unassign
ru: Снять

source: Player added successfully!
ru: Игрок успешно добавлен!

source: Player updated successfully!
ru: Игрок успешно обновлен!

source: Player deleted successfully!
ru: Игрок успешно удален!

source: Failed to add player
ru: Не удалось добавить игрока

source: Failed to update player
ru: Не удалось обновить игрока

source: Failed to delete player
ru: Не удалось удалить игрока

source: MVP assigned successfully!
ru: MVP успешно назначен!

source: Failed to assign MVP
ru: Не удалось назначить MVP

source: MVP unassigned successfully!
ru: MVP успешно снят!

source: Failed to unassign MVP
ru: Не удалось снять MVP

source: Alliance Management
ru: Управление альянсами

source: Edit Alliance
ru: Редактировать альянс

source: Alliance Details
ru: Детали альянса

source: Is Current Winner
ru: Текущий победитель

source: Alliance added successfully!
ru: Альянс успешно добавлен!

source: Alliance updated successfully!
ru: Альянс успешно обновлен!

source: Alliance deleted successfully!
ru: Альянс успешно удален!

source: Failed to add alliance
ru: Не удалось добавить альянс

source: Failed to update alliance
ru: Не удалось обновить альянс

source: Failed to delete alliance
ru: Не удалось удалить альянс

source: Winner assigned successfully!
ru: Победитель успешно назначен!

source: Failed to assign winner
ru: Не удалось назначить победителя

source: Winner unassigned successfully!
ru: Победитель успешно снят!

source: Failed to unassign winner
ru: Не удалось снять победителя

source: Event Management
ru: Управление событиями

source: Edit Event
ru: Редактировать событие

source: Event Name
ru: Название события

source: Event Date
ru: Дата события

source: Event Description
ru: Описание события

source: Event Status
ru: Статус события

source: Has MVP
ru: Есть MVP

source: Has Winner
ru: Есть победитель

source: Event Details
ru: Детали события

source: Event Assignments
ru: Назначения события

source: MVP Players
ru: Игроки MVP

source: Winning Alliance
ru: Победивший альянс

source: Event Summary
ru: Сводка по событию

source: Completion Status
ru: Статус завершения

source: Created
ru: Создано

source: Event added successfully!
ru: Событие успешно добавлено!

source: Event updated successfully!
ru: Событие успешно обновлено!

source: Event deleted successfully!
ru: Событие успешно удалено!

source: Failed to add event
ru: Не удалось добавить событие

source: Failed to update event
ru: Не удалось обновить событие

source: Failed to delete event
ru: Не удалось удалить событие

source: Failed to load event details
ru: Не удалось загрузить детали события

source: Back to Events
ru: Назад к событиям

source: Back to Players
ru: Назад к игрокам

source: Back to Alliances
ru: Назад к альянсам

source: View Event
ru: Посмотреть событие

source: View Player
ru: Посмотреть игрока

source: View Alliance
ru: Посмотреть альянс

source: Are you sure?
ru: Вы уверены?

source: This action cannot be undone.
ru: Это действие нельзя отменить.

source: Yes, delete it!
ru: Да, удалить!

source: No, cancel
ru: Нет, отмена

source: Loading...
ru: Загрузка...

source: No data available
ru: Нет данных

source: Search...
ru: Поиск...

source: Filter
ru: Фильтр

source: Clear
ru: Очистить

source: Apply
ru: Применить

source: Reset
ru: Сбросить

source: Previous
ru: Предыдущая

source: Next
ru: Следующая

source: First
ru: Первая

source: Last
ru: Последняя

source: Page
ru: Страница

source: of
ru: из

source: entries
ru: записей

source: Show
ru: Показать

source: per page
ru: на странице

source: Today
ru: Сегодня

source: Yesterday
ru: Вчера

source: This Week
ru: На этой неделе

source: This Month
ru: В этом месяце

source: This Year
ru: В этом году

source: Never
ru: Никогда

source: Just now
ru: Только что

source: minutes ago
ru: минут назад

source: hours ago
ru: часов назад

source: days ago
ru: дней назад

source: weeks ago
ru: недель назад

source: months ago
ru: месяцев назад

source: years ago
ru: лет назад

source: This field is required
ru: Это поле обязательно

source: Please enter a valid email address
ru: Пожалуйста, введите действительный адрес электронной почты

source: Passwords do not match
ru: Пароли не совпадают

source: Password must be at least 8 characters long
ru: Пароль должен содержать не менее 8 символов

source: Username must be at least 3 characters long
ru: Имя пользователя должно содержать не менее 3 символов

source: Username already exists
ru: Имя пользователя уже существует

source: Email already exists
ru: Электронная почта уже существует

source: Invalid username or password
ru: Неверное имя пользователя или пароль

source: Account created successfully!
ru: Аккаунт успешно создан!

source: Login successful!
ru: Вход выполнен успешно!

source: Logout successful!
ru: Выход выполнен успешно!

source: Password updated successfully!
ru: Пароль успешно обновлен!

source: Profile updated successfully!
ru: Профиль успешно обновлен!

source: Bot Settings
ru: Настройки бота

source: Telegram Bot
ru: Telegram бот

source: Discord Bot
ru: Discord бот

source: Bot Token
ru: Токен бота

source: Channel ID
ru: ID канала

source: Enable Notifications
ru: Включить уведомления

source: Language
ru: Язык

source: English
ru: Английский

source: Russian
ru: Русский

source: Save Settings
ru: Сохранить настройки

source: Test Connection
ru: Тест соединения

source: Settings saved successfully!
ru: Настройки успешно сохранены!

source: Failed to save settings
ru: Не удалось сохранить настройки

source: Bot connection test successful!
ru: Тест соединения с ботом успешен!

source: Bot connection test failed
ru: Тест соединения с ботом не удался

source: Feedback
ru: Обратная связь

source: Subject
ru: Тема

source: Message
ru: Сообщение

source: Bug Report
ru: Сообщение об ошибке

source: Feature Request
ru: Запрос функции

source: Suggestion
ru: Предложение

source: Improvement
ru: Улучшение

source: Other
ru: Другое

source: Submit Feedback
ru: Отправить отзыв

source: Give Feedback
ru: Оставить отзыв

source: Feedback submitted successfully!
ru: Отзыв успешно отправлен!

source: Failed to submit feedback
ru: Не удалось отправить отзыв

source: Admin Panel
ru: Панель администратора

source: User Management
ru: Управление пользователями

source: Create User
ru: Создать пользователя

source: Admin Users
ru: Пользователи-администраторы

source: User Settings
ru: Настройки пользователя

source: Role
ru: Роль

source: Admin
ru: Администратор

source: User
ru: Пользователь

source: Inactive
ru: Неактивен

source: Last Login
ru: Последний вход

source: User created successfully!
ru: Пользователь успешно создан!

source: User updated successfully!
ru: Пользователь успешно обновлен!

source: User deleted successfully!
ru: Пользователь успешно удален!

source: Failed to create user
ru: Не удалось создать пользователя

source: Failed to update user
ru: Не удалось обновить пользователя

source: Failed to delete user
ru: Не удалось удалить пользователя

source: MVP Assignment Announcement
ru: Объявление о назначении MVP

source: Winner Assignment Announcement
ru: Объявление о назначении победителя

source: MVP Unassignment Announcement
ru: Объявление о снятии MVP

source: has been assigned as MVP for
ru: назначен MVP за

source: has been unassigned from MVP for
ru: снят с MVP за

source: has won the event
ru: выиграл событие

source: Congratulations to
ru: Поздравляем

source: for being selected as MVP!
ru: с назначением MVP!

source: for winning the event!
ru: с победой в событии!

source: Time
ru: Время

source: Player
ru: Игрок

source: Total MVP Count
ru: Общее количество MVP

source: Total Win Count
ru: Общее количество побед

source: Previous MVP
ru: Предыдущий MVP

source: Previous Winner
ru: Предыдущий победитель

source: No previous MVP
ru: Нет предыдущего MVP

source: No previous winner
ru: Нет предыдущего победителя

source: Rotation Logic
ru: Логика ротации

source: Fair distribution
ru: Справедливое распределение

source: Equal opportunities
ru: Равные возможности

source: System managed
ru: Управляется системой

source: Automatic rotation
ru: Автоматическая ротация

source: Manual assignment
ru: Ручное назначение

source: Admin override
ru: Переопределение администратора

source: Special circumstances
ru: Особые обстоятельства

source: Event completed
ru: Событие завершено

source: Event in progress
ru: Событие в процессе

source: Event pending
ru: Событие ожидает

source: Event cancelled
ru: Событие отменено

source: Event postponed
ru: Событие отложено

source: Event rescheduled
ru: Событие перенесено

source: Event updated
ru: Событие обновлено

source: Event created
ru: Событие создано

source: Event deleted
ru: Событие удалено

source: Assignment updated
ru: Назначение обновлено

source: Assignment created
ru: Назначение создано

source: Assignment deleted
ru: Назначение удалено

source: System notification
ru: Системное уведомление

source: Important update
ru: Важное обновление

source: Reminder
ru: Напоминание

source: Alert
ru: Предупреждение

source: Info
ru: Информация

source: Success
ru: Успех

source: Warning
ru: Предупреждение

source: Error
ru: Ошибка

source: Debug
ru: Отладка

source: Trace
ru: Трассировка

source: Critical
ru: Критический

source: Fatal
ru: Фатальный

source: Unknown
ru: Неизвестно

source: N/A
ru: Н/Д

source: TBD
ru: Будет определено

source: TBA
ru: Будет объявлено

source: Coming Soon
ru: Скоро

source: Under Construction
ru: В разработке

source: Maintenance Mode
ru: Режим обслуживания

source: Service Unavailable
ru: Сервис недоступен

source: Access Denied
ru: Доступ запрещен

source: Forbidden
ru: Запрещено

source: Not Found
ru: Не найдено

source: Internal Server Error
ru: Внутренняя ошибка сервера

source: Bad Request
ru: Неверный запрос

source: Unauthorized
ru: Не авторизован

source: Method Not Allowed
ru: Метод не разрешен

source: Not Acceptable
ru: Неприемлемо

source: Request Timeout
ru: Таймаут запроса

source: Conflict
ru: Конфликт

source: Gone
ru: Удалено

source: Length Required
ru: Требуется длина

source: Precondition Failed
ru: Предварительное условие не выполнено

source: Request Entity Too Large
ru: Слишком большое тело запроса

source: Request URI Too Long
ru: Слишком длинный URI запроса

source: Unsupported Media Type
ru: Неподдерживаемый тип медиа

source: Requested Range Not Satisfiable
ru: Запрошенный диапазон не выполним

source: Expectation Failed
ru: Ожидание не выполнено

source: I'm a teapot
ru: Я чайник

source: Misdirected Request
ru: Неправильно направленный запрос

source: Unprocessable Entity
ru: Необрабатываемая сущность

source: Locked
ru: Заблокировано

source: Failed Dependency
ru: Неудачная зависимость

source: Too Early
ru: Слишком рано

source: Upgrade Required
ru: Требуется обновление

source: Precondition Required
ru: Требуется предварительное условие

source: Too Many Requests
ru: Слишком много запросов

source: Request Header Fields Too Large
ru: Поля заголовка запроса слишком большие

source: Unavailable For Legal Reasons
ru: Недоступно по юридическим причинам

source: Not Implemented
ru: Не реализовано

source: Bad Gateway
ru: Плохой шлюз

source: Gateway Timeout
ru: Таймаут шлюза

source: HTTP Version Not Supported
ru: Версия HTTP не поддерживается

source: Variant Also Negotiates
ru: Вариант также ведет переговоры

source: Insufficient Storage
ru: Недостаточно места

source: Loop Detected
ru: Обнаружен цикл

source: Not Extended
ru: Не расширено

source: Network Authentication Required
ru: Требуется сетевая аутентификация

source: Network Connect Timeout Error
ru: Ошибка таймаута сетевого подключения

source: MVP Rotation Status
ru: Статус ротации MVP

source: Winner Rotation Status
ru: Статус ротации победителей

source: All Players
ru: Все игроки

source: All Alliances
ru: Все альянсы

source: All Events
ru: Все события

source: MVP Assignment Available
ru: Назначение MVP доступно

source: MVP Assignment Not Available
ru: Назначение MVP недоступно

source: Winner Assignment Available
ru: Назначение победителя доступно

source: Winner Assignment Blocked
ru: Назначение победителя заблокировано

source: Eligible Players
ru: Подходящие игроки

source: Eligible Alliances
ru: Подходящие альянсы

source: No eligible players or events.
ru: Нет подходящих игроков или событий.

source: Not all alliances have won yet. Complete current rotation first.
ru: Не все альянсы еще побеждали. Сначала завершите текущую ротацию.

source: Rotation
ru: Ротация

source: Never MVP
ru: Никогда не был MVP

source: Former Winner
ru: Бывший победитель

source: Never Won
ru: Никогда не побеждал

source: Excluded
ru: Исключен

source: Excluded from rotation
ru: Исключен из ротации

source: Show MVP History
ru: Показать историю MVP

source: Delete Player
ru: Удалить игрока

source: Delete Alliance
ru: Удалить альянс

source: Delete Event
ru: Удалить событие

source: Include in MVP Rotation
ru: Включить в ротацию MVP

source: Exclude from MVP Rotation
ru: Исключить из ротации MVP

source: Previous MVPs
ru: Предыдущие MVP

source: Former Winners
ru: Бывшие победители

source: Total MVP Awards
ru: Всего наград MVP

source: Total Wins
ru: Всего побед

source: Active Players
ru: Активных игроков

source: Excluded Players
ru: Исключенных игроков

source: Eligible for MVP
ru: Подходящих для MVP

source: No Players Yet
ru: Пока нет игроков

source: No Alliances Yet
ru: Пока нет альянсов

source: No Events Yet
ru: Пока нет событий

source: Players have not been added to the system yet.
ru: Игроки еще не добавлены в систему.

source: Alliances have not been added to the system yet.
ru: Альянсы еще не добавлены в систему.

source: Add First Player
ru: Добавить первого игрока

source: Add First Alliance
ru: Добавить первый альянс

source: Create First Event
ru: Создать первое событие

source: Confirm Deletion
ru: Подтвердить удаление

source: Are you sure you want to delete player
ru: Вы уверены, что хотите удалить игрока

source: Are you sure you want to delete alliance
ru: Вы уверены, что хотите удалить альянс

source: Are you sure you want to delete event
ru: Вы уверены, что хотите удалить событие

source: This will also delete all MVP assignments for this player and cannot be undone.
ru: Это также удалит все назначения MVP для этого игрока и не может быть отменено.

source: This will also delete all winner assignments for this alliance and cannot be undone.
ru: Это также удалит все назначения победителей для этого альянса и не может быть отменено.
