Repository: knoticoo/kings
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: This will also delete all MVP and winner assignments for this event and cannot be undone.
ru: Это также удалит все назначения MVP и победителей для этого события и не может быть отменено.

source: Loading MVP history...
ru: Загрузка истории MVP...

source: Event Participations
ru: Участий в событиях

source: Detailed History
ru: Детальная история

source: No MVP History Yet
ru: Пока нет истории MVP

source: This player has not received MVP awards yet.
ru: Этот игрок еще не получал награду MVP.

source: Failed to load MVP history
ru: Не удалось загрузить историю MVP

source: Error loading MVP history
ru: Ошибка при загрузке истории MVP

source: Date not specified
ru: Дата не указана

source: Are you sure you want to unassign MVP for
ru: Вы уверены, что хотите отменить назначение MVP для

source: Confirm Change
ru: Подтвердить изменение

source: Are you sure you want to exclude player
ru: Вы уверены, что хотите исключить игрока

source: from MVP rotation?
ru: из ротации MVP?

source: Are you sure you want to include player
ru: Вы уверены, что хотите включить игрока

source: in MVP rotation?
ru: в ротацию MVP?

source: Player will remain visible in the list but will not participate in MVP rotation until re-enabled.
ru: Игрок останется видимым в списке, но не будет участвовать в ротации MVP до повторного включения.

source: Player will become available for MVP assignment according to rotation logic.
ru: Игрок снова станет доступен для назначения MVP согласно логике ротации.

source: Exclude
ru: Исключить

source: Include
ru: Включить

source: Checking rotation status...
ru: Проверка статуса ротации...

source: Add New Alliance
ru: Добавить новый альянс

source: Alliance Information
ru: Информация о альянсе

source: Enter alliance name
ru: Введите название альянса

source: Alliance names must be unique and cannot exceed 100 characters.
ru: Названия альянсов должны быть уникальными и не могут превышать 100 символов.

source: Winner Rotation
ru: Ротация победителей

source: New alliances will be able to compete for winner assignment after all current alliances have won at least once.
ru: Новые альянсы смогут претендовать на назначение победителя после того, как все текущие альянсы победят хотя бы один раз.

source: Need Help?
ru: Нужна помощь?

source: Use meaningful alliance names that reflect groups or guilds
ru: Используйте осмысленные названия альянсов, которые отражают группы или гильдии

source: Alliance names must be unique in the system
ru: Названия альянсов должны быть уникальными в системе

source: After adding, alliances can be assigned as winners when it's their turn
ru: После добавления альянсы могут быть назначены победителями, когда придет их очередь

source: You can edit or delete alliances later if needed
ru: При необходимости вы можете редактировать или удалять альянсы позже

source: Alliance name is required.
ru: Название альянса обязательно.

source: Add New Event
ru: Добавить новое событие

source: Event Information
ru: Информация о событии

source: Pending
ru: Ожидает

source: Current Player Information
ru: Текущая информация об игроке

source: Current Alliance Information
ru: Текущая информация о альянсе

source: Current Name
ru: Текущее название

source: MVP Status
ru: Статус MVP

source: Winner Status
ru: Статус победителя

source: Last Updated
ru: Последнее обновление

source: Edit Player Information
ru: Редактировать информацию об игроке

source: Enter player name
ru: Введите имя игрока

source: Player names must be unique and cannot exceed 100 characters.
ru: Имена игроков должны быть уникальными и не могут превышать 100 символов.

source: This player is currently MVP. Renaming will not affect MVP status.
ru: Этот игрок в настоящее время MVP. Переименование не повлияет на статус MVP.

source: This player has been MVP
ru: Этот игрок был MVP

source: time(s). Renaming will not affect MVP history.
ru: раз(а). Переименование не повлияет на историю MVP.

source: Update Player
ru: Обновить игрока

source: Danger Zone
ru: Опасная зона

source: Permanently delete this player from the system. This action cannot be undone and will also delete all MVP assignments for this player.
ru: Навсегда удалить этого игрока из системы. Это действие не может быть отменено и также удалит все назначения MVP для этого игрока.

source: This will permanently delete:
ru: Это навсегда удалит:

source: Player record
ru: Запись об игроке

source: All MVP assignments for this player
ru: Все назначения MVP для этого игрока

source: MVP history and statistics
ru: Историю и статистику MVP

source: Add New Player
ru: Добавить нового игрока

source: Player Information
ru: Информация об игроке

source: MVP Rotation
ru: Ротация MVP

source: New players will be able to receive MVP assignment after all current players have been MVP at least once.
ru: Новые игроки смогут получить назначение MVP после того, как все текущие игроки побывают MVP хотя бы один раз.

source: Use meaningful player names that are easy to identify
ru: Используйте осмысленные имена игроков, которые легко идентифицировать

source: Player names must be unique in the system
ru: Имена игроков должны быть уникальными в системе

source: After adding, players can be assigned as MVP when it's their turn
ru: После добавления игроки могут быть назначены MVP, когда придет их очередь

source: You can edit or delete players later if needed
ru: При необходимости вы можете редактировать или удалять игроков позже

source: Player name is required.
ru: Имя игрока обязательно.

source: MVP Assignment History
ru: История назначений MVP

source: Assign More MVP
ru: Назначить еще MVP

source: No MVP Assigned
ru: MVP не назначен

source: This event has no MVP yet.
ru: У этого события еще нет MVP.

source: No Winner Assigned
ru: Победитель не назначен

source: This event has no winning alliance yet.
ru: У этого события еще нет победившего альянса.

source: You can assign MVP to eligible players below.
ru: ?? ?????? ????????? MVP ?????????? ??????? ????.

source: No eligible players or events for MVP assignment.
ru: ??? ?????????? ??????? ??? ??????? ??? ?????????? MVP.

source: MVP Assignment Form
ru: ????? ?????????? MVP

source: New MVP
ru: ????? MVP

source: Only players eligible for MVP are shown.
ru: ???????? ?????? ??????, ?????????? ??? MVP.

source: Already has MVP
ru: ??? ???? MVP

source: All events are shown. You can assign multiple MVPs for one event.
ru: ???????? ??? ???????. ????? ????????? ????????? MVP ??? ?????? ???????.

source: Selected player will become current MVP
ru: ????????? ????? ?????? ??????? MVP

source: Any previous MVP status will be removed from other players
ru: ????? ?????????? ?????? MVP ????? ????? ? ?????? ???????

source: Player's MVP count will be increased
ru: ??????? MVP ?????? ????? ????????

source: Event will be marked as having assigned MVP
ru: ??????? ????? ???????? ??? ??????? ???????????? MVP

source: You can assign multiple MVPs for one event (for recurring events)
ru: ????? ????????? ????????? MVP ??? ?????? ??????? (??? ????????????? ???????)

source: Currently no available players for MVP assignment.
ru: ? ????????? ????? ??? ????????? ??????? ??? ?????????? MVP.

source: All events already have MVP assigned. Create new events to assign additional MVPs.
ru: ? ???? ??????? ??? ???????? MVP. ???????? ????? ??????? ??? ?????????? ?????????????? MVP.

source: MVP Rotation Rules
ru: ??????? ??????? MVP

source: Priority is given to players with the least MVP count
ru: ????????? ???????? ??????? ? ?????????? ??????????? MVP

source: One MVP per Event
ru: ???? MVP ?? ???????

source: Each event can have only one MVP player
ru: ?????? ??????? ????? ????? ?????? ?????? ?????? MVP

source: Only one player can be current MVP at a time
ru: ?????? ???? ????? ????? ???? ??????? MVP ????????????

source: All MVP assignments are tracked and counted
ru: ??? ?????????? MVP ????????????? ? ??????????????

source: MVP for event
ru: MVP ??? ???????
